w8d1/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
            params[:post][:sub_ids].each do |sub_id|
                @post.subs = Sub.find_by(id: sub_id)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]