w8d1/reddit_clone/app/controllers/subs_controller.rb

    def require_moderator
        @sub = Sub.find_by(id:params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]