w7d1/cats_99/app/controllers/cats_controller.rb

    def index
        @kats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @kat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @kat = Cat.new(cat_params)
        if @kat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @kat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def update
        @kat = Cat.find(params[:id])
        if Cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "birth_date" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Kat thing"], ["color", "Black"], ["sex", "F"], ["birth_date", "2016-03-11"], ["description", "Is it not a cat?"], ["updated_at", "2020-03-23 23:45:15.978812"], ["id", 2]]