w6d3/first_routes/app/controllers/artworks_controller.rb

    def index
        user = User.find_by(id:params[:user_id])
        art1 = Artwork.find_by(artist_id:user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 71], ["LIMIT", 1]]

    def create
        art = Artwork.create(artwork_params)
        if art.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "justart"], ["image_url", "asdfadfsadf"], ["artist_id", 75]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "morethanart"], ["image_url", "sickurl"], ["id", 46]]

    def show
        art = Artwork.find_by(id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]

    def update
        art = Artwork.find(params[:id])
        if art.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2 WHERE "artworks"."id" = $3  [["title", "morethanart"], ["image_url", "sickurl"], ["id", 46]]

    def destroy
        art = Artwork.find(params[:id])
        art.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 46]]