w6d3/first_routes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 42], ["viewer_id", 75]]
---
    def create
        art_share = ArtworkShare.new(artwork_share_params)
        if art_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
    def destroy
        art_share = ArtworkShare.find(params[:id])
        art_share.destroy