w6d3/first_routes/app/controllers/comments_controller.rb

    def index
        if comment_params.key?(:user_id)
            render json:Comment.where(user_id:comment_params[:user_id])
        elsif comment_params.key?(:artwork_id)
            render json:Comment.where(artwork_id:comment_params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 71]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 44]]