w6d3/first_routes/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id") VALUES ($1, $2, $3) RETURNING "id"  [["body", "wow what a pretty art"], ["user_id", 75], ["artwork_id", 45]]

    def index
        if comment_params
        render json:Comment.all
---
SELECT "comments".* FROM "comments"