w6d3/first_routes/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("user_name") VALUES ($1) RETURNING "id"  [["user_name", "Turner"]]

  def destroy
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "asdfijvijoadsmijoadfsijv"], ["id", 1]]