w7d3/my_music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find_by(id:params[:id])
        @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "peter edm machine"], ["updated_at", "2020-03-25 23:28:53.190239"], ["id", 1]]